### What is Pandas?

An important step for any data scientist is to prepare and clean the data so that it could be used later for deeper analysis. Pandas library helps in ETL process (Extract, Transform and Load).

Pandas provides rich set of functions to process various types of data.  It is built on top of the NumPy and matplotlib library and one can harness the power of both these libraries in tandem with the power of pandas.

In [1]:
import numpy as np
import pandas as pd

### Data Structures in Pandas
Pandas can work with three data structures:

    Series-1 dimension array with homgenous or hetrogenous data
    DataFrame - 2 dimensions denoting rows and columns
    Panel - 3 dimensions denoting x, y, z axis (Example Excel)

### Series
The main difference between a series and NumPy array is that series may have axis labels, a NumPy array doesn't.

#### Creating Series
The constructor for series is : pandas.Series(data, index, dtype, copy)

Here,

    data: data (can be lists, ndarrays, dictionaries etc.)
    index: unique, hashable and same length as data (default is np.arange(n) where n is length of data)
    dtype: data type of series values
    copy: copy data (default False)

In [2]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
# as the above output shows every series has index value. In pandas we can pass index values too
lst = [1,2,3,4]
lbl = ['a','b','c','d']
pd.Series(lst, index=lbl)

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
# changing datatypes of series
pd.Series([10,20,30,40],dtype='float')

0    10.0
1    20.0
2    30.0
3    40.0
dtype: float64

In [5]:
# creating series from dictionary
# here the key will be considered as the index and values will become the series

dic = {'firstname':'Donald Duck', 'age':65, 'city':'Disney World'}
pd.Series(dic)

firstname     Donald Duck
age                    65
city         Disney World
dtype: object

In [6]:
#if the index values are passed through a list, all the indexes are passed and 
# the corresponding values of keys are passed in the series
# if a particular index doesn't match the key in dictionary then NaN is passed
# NaN stands for Not a Number

lbl = ['firstname', 'lastname', 'age', ]
dic = {'firstname':'Donald Duck', 'age':65, 'city':'Disney World'}

pd.Series(dic, lbl)

firstname    Donald Duck
lastname             NaN
age                   65
dtype: object

In [7]:
# constant with index values: list
pd.Series(10, index=['a','b','c'])

a    10
b    10
c    10
dtype: int64

In [8]:
# constant with index values:range function
pd.Series(10,index=range(5))

0    10
1    10
2    10
3    10
4    10
dtype: int64

#### Accessing series

We will be using slicing, range slicing and indexing for accessing data of series. 
We will under stand the attributes of series index and values

In [9]:
# series of numbers from 11 to 20
s = pd.Series(range(11,21))

# series from a dictionary
d = pd.Series({'firstname':'Donald Duck', 'age':65, 'city':'Disney World'})

In [10]:
s

0    11
1    12
2    13
3    14
4    15
5    16
6    17
7    18
8    19
9    20
dtype: int64

In [11]:
d

firstname     Donald Duck
age                    65
city         Disney World
dtype: object

In [12]:
#accessing data by index
print(s[1])
print(d['age'])

12
65

In [13]:
#accessing the first three elements
s[:3]

0    11
1    12
2    13
dtype: int64

In [14]:
#all indexes
d.index

Index(['firstname', 'age', 'city'], dtype='object')

In [15]:
#all values
d.values

array(['Donald Duck', 65, 'Disney World'], dtype=object)

### DataFrames
It generally refers to tabular data: a data structure representing instances(rows), each of which consists of a number of measurements(columns). Alternatively, each row may be treated as a single observation of multiple variables.

#### Creating DataFrames
The constructor for pandas dataframe object is pandas.DataFrame( data, index, columns, dtype, copy).

Here,

    data: various forms (ndarray, series, map, lists, dict, constants, another DataFrame)
    index: index labels (default np.arange(n))
    columns: column names (default np.arange(n)); True only when index is not specified
    dtype: Data type of each column
    copy: copying of data (default False)

In [16]:
#creating dataframe from list
data = ['Doremon', 'Chota Bhim', 'Powerpuff girls', 'Dexter']
pd.DataFrame(data, columns=['Name'])

              Name
0          Doremon
1       Chota Bhim
2  Powerpuff girls
3           Dexter

In [17]:
#dataframe from list of lists
pd.DataFrame([[1,2,3],[4,5,6]])

   0  1  2
0  1  2  3
1  4  5  6

In [18]:
#creating dataframe with columns called 'Name' and 'Age' from list of lists
data =[['Rob',25],['Bobby',30],['John',21],['Danny',32],['Manny',23]]
pd.DataFrame(data,columns = ['Name','Age'])

    Name  Age
0    Rob   25
1  Bobby   30
2   John   21
3  Danny   32
4  Manny   23

In [19]:
# converting 2D array into data frame 
pd.DataFrame(np.arange(10,20).reshape(5,2),columns=["A","B"])

    A   B
0  10  11
1  12  13
2  14  15
3  16  17
4  18  19

In [20]:
#creating dataframe from a dictionary
dic = {'name':['Jitesh','Kalpesh','Simran'],'math':[80,70,85],'science':[78,56,68]}
pd.DataFrame(dic)

      name  math  science
0   Jitesh    80       78
1  Kalpesh    70       56
2   Simran    85       68

In [21]:
#creating dataframe from dictionary and passing index values
pd.DataFrame(dic, index=['J', 'K', 'S'])

      name  math  science
J   Jitesh    80       78
K  Kalpesh    70       56
S   Simran    85       68

In [22]:
#creating dataframe from list of dictionaries
data = [{'name':'Google', 'rank':1}, {'name':'Facebook', 'rank':2}, {'name':'IBM', 'rank':3}, {'name':'Microsoft', 'rank':4}]
pd.DataFrame(data)

        name  rank
0     Google     1
1   Facebook     2
2        IBM     3
3  Microsoft     4

In [23]:
#dataframe from series
pd.DataFrame({'Name':pd.Series(['Rob','Bobby','John','Danny','Manny'],index=['R','B','J','D','M']),
                    'Age':pd.Series([25,30,21,32,23],index=['R','B','J','D','M'])})

    Name  Age
R    Rob   25
B  Bobby   30
J   John   21
D  Danny   32
M  Manny   23

In [24]:
# creating dataframe from lists of dictionary
data = [{'name':'Google', 'rank':1}, 
        {'name':'Facebook', 'rank':2}, 
        {'name':'IBM', 'rank':3}, 
        {'name':'Microsoft', 'rank':4}]
df = pd.DataFrame(data)
df

        name  rank
0     Google     1
1   Facebook     2
2        IBM     3
3  Microsoft     4

#### Modifying Dataframe

In [25]:
# adding new column to dataframe
df['owner'] = ['Larry Page', "Mark Z", 'test', 'Bill Gates']
df['shares'] = [70, 15, 2, 13] 
df

        name  rank       owner  shares
0     Google     1  Larry Page      70
1   Facebook     2      Mark Z      15
2        IBM     3        test       2
3  Microsoft     4  Bill Gates      13

In [26]:
#adding new index
df.index=['G', 'F', 'I', 'M']
df

        name  rank       owner  shares
G     Google     1  Larry Page      70
F   Facebook     2      Mark Z      15
I        IBM     3        test       2
M  Microsoft     4  Bill Gates      13

#### Indexing and Slicing

In [27]:
# accessing records
#accessing data by column name
df['name']

G       Google
F     Facebook
I          IBM
M    Microsoft
Name: name, dtype: object

In [28]:
#accessing multiple column names
df[['name', 'owner']]

        name       owner
G     Google  Larry Page
F   Facebook      Mark Z
I        IBM        test
M  Microsoft  Bill Gates

In [29]:
#fetch records by index name
print(df.ix['I']) #deprecated

name       IBM
rank         3
owner     test
shares       2
Name: I, dtype: object

C:\Users\itvedant-le2\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated

In [30]:
#fetch records by index name
print(df.loc['G'])

name          Google
rank               1
owner     Larry Page
shares            70
Name: G, dtype: object

In [31]:
# acccessing data using row number. Row number always begins with zero
print(df.iloc[0])

name          Google
rank               1
owner     Larry Page
shares            70
Name: G, dtype: object

In [32]:
#range selection of complete row
df.iloc[0:2]

       name  rank       owner  shares
G    Google     1  Larry Page      70
F  Facebook     2      Mark Z      15

In [33]:
#range selection of rows and columns
df.iloc[0:2, 0:2]

       name  rank
G    Google     1
F  Facebook     2

In [34]:
#index selection of row and name selection of columns
df.loc[['G','I'], ['name']]

     name
G  Google
I     IBM

In [35]:
#accessing multiple rows, if an index that is not available that is passed it will display NaN
df.loc[['G','X'], ['name']]

C:\Users\itvedant-le2\Anaconda3\lib\site-packages\pandas\core\indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

     name
G  Google
X     NaN

In [36]:
#accessing multiple rows and columns
df.loc[['G','I'], ['name','owner']]

     name       owner
G  Google  Larry Page
I     IBM        test

In [37]:
#change the str index to numeric index
df.index=range(len(df))
df

        name  rank       owner  shares
0     Google     1  Larry Page      70
1   Facebook     2      Mark Z      15
2        IBM     3        test       2
3  Microsoft     4  Bill Gates      13

In [38]:
#range selection of row and name selection of columns
df.loc[0:2,'name']

0      Google
1    Facebook
2         IBM
Name: name, dtype: object

In [39]:
# accessing row with range and multiple columns by name.
df.loc[0:2,['name','owner']]

       name       owner
0    Google  Larry Page
1  Facebook      Mark Z
2       IBM        test

In [40]:
#slicing using column name and index
# df[col][row]
df['name'][1]

'Facebook'

In [41]:
#df.iloc[row index,col index] in number
df.iloc[2,0]

'IBM'

In [42]:
#df.loc[row, colname]
df.loc[0,'name']

'Google'

In [43]:
#changing index back to str
df.index=['G', 'F', 'I', 'M']

In [44]:
# df[col][row]
df['owner']['G']

'Larry Page'

In [45]:
#df.iloc[row index,col index] in number
df.iloc[0,2]

'Larry Page'

In [46]:
#df.loc[row, colname]
df.loc['G','owner']

'Larry Page'

#### Modifying Dataframe continued

In [47]:
# Deleting columns from dataframe
del df['owner']
df

        name  rank  shares
G     Google     1      70
F   Facebook     2      15
I        IBM     3       2
M  Microsoft     4      13

In [48]:
#deleting a column using drop function. axis 1 stands for column. 
# While dropping a column the first parameter is column name and axis = 1
df.drop('rank', axis=1)

        name  shares
G     Google      70
F   Facebook      15
I        IBM       2
M  Microsoft      13

In [49]:
#deleting a row using drop function. axis 0 stands for row
# While dropping a row the first parameter is index and axis = 0
df.drop('I', axis=0)

        name  rank  shares
G     Google     1      70
F   Facebook     2      15
M  Microsoft     4      13

#### Extracting data from various sources

In [50]:
#Copying from clipboard, copy any table from internet and execute the following command:
pd.read_clipboard()

EmptyDataError: No columns to parse from file

If the file has a .csv format use

pandas.read_csv(filepath_or_buffer, sep=',', delimiter=None, header='infer',names=None, index_col=None, usecols=None)

** to convert a file into a DataFrame. Most of the files you encounter will be in CSV format.

Here,

    filepath_or_buffer: the path to the file
    sep: Delimiter to use
    delimiter: Alternative argument name for sep (default None)
    header: Row number(s) to use as the column names, and the start of the data
    names: List of column names to use
    index_col: Column to use as the row labels of the DataFrame
    usecols: Return a subset of the columns

In [ ]:
#get data from .csv file into panda dataframe
df = pd.read_csv('marks.csv')
df

In [ ]:
#get data from .csv file into panda dataframe using sep
df = pd.read_csv('marks.csv', sep=":")
df

#### reading files and understanding data

In [ ]:
df = pd.read_csv('matches.csv')
df

In [ ]:
# head() : show only first five elements of the DataFrame
df.head()

In [ ]:
# head function also accepts a numeric input when you wish to more records
df.head(10)

In [ ]:
# tail() : show only last five elements of the DataFrame
df.tail()

In [ ]:
# tail function also accepts a numeric input when you wish to more records
df.tail(2)

In [ ]:
# General information of every column
df.info()

In [ ]:
# Data type of every column
df.dtypes

In [ ]:
# Display column names
df.columns

In [ ]:
# Check dimensions: To check dimensions of dataframe
df.shape

In [ ]:
# the describe function will return count, mean, standard deviation, min, max, q1, q2, q3 of each column in the dataframe
df.describe()

In [ ]:
# Check missing values per column
df.isnull()

In [ ]:
# Check missing values and count per column 
df.isnull().sum()

In [ ]:
# to check not a number value in the data
df.isna().sum()

In [ ]:
# Check number of unique values per column
df.nunique()

In [ ]:
#Give unique value from column
df['season'].unique()

In [ ]:
# Will count how many time that value is repeat in data
df['season'].value_counts()

In [ ]:
#When you want to squeeze the output you need to change the same using set_options
pd.set_option('max_rows', 5, 'max_columns', 5)
df

In [ ]:
# Dropping missing values
df.dropna()